elena_ovsyannikova/week6/filmlibrary/app/views/films/_form.html.erb

  <%= f.label :director_id %>
  <%= f.select :director_id, Director.pluck(:name, :id), :include_blank => true %>
---
SELECT "directors"."name", "directors"."id" FROM "directors"