elena_ovsyannikova/week6/filmlibrary/app/views/films/show.html.erb

       <li><strong>Title: </strong> <%= @film.title %></li>
      <% if @film.director.present? %>
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]

<div>
  <% @film.ratings.each do |rating| %>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."film_id" = $1  [["film_id", 96]]