elena_ovsyannikova/week6/filmlibrary/app/controllers/films_controller.rb

INSERT INTO "films" ("title", "release_date", "image", "plot", "created_at", "updated_at", "rating") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "films".* FROM "films" WHERE "films"."title" = $1 LIMIT $2  [["title", "Aquaman"], ["LIMIT", 1]]
---
   def show_search
     url = "#{$API_BASE_URL}/movie/#{params[:id]}?api_key=#{$API_KEY}"
     @movie = HTTParty.get(url)
     # @film = Film.create :title => @movie['original_title'], :image => "https://image.tmdb.org/t/p/w500/#{@movie['poster_path']}", :release_date => @movie["release_date"], :rating => @movie["vote_average"], :plot => @movie["overview"]

     @film=Film.find_or_create_by(title:  @movie['original_title']) do |film|

SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", 91], ["LIMIT", 1]]
---
  def show
    @film = Film.find params[:id]

SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", 91], ["LIMIT", 1]]
---
  def edit
    @film = Film.find params[:id]

SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", 86], ["LIMIT", 1]]
UPDATE "films" SET "genre" = $1, "country" = $2, "image" = $3, "plot" = $4, "updated_at" = $5 WHERE "films"."id" = $6  [["genre", ""], ["country", ""], ["image", "https://upload.wikimedia.org/wikipedia/en/f/f0/Lion_%282016_film%29.png"], ["plot", ""], ["updated_at", "2019-01-24 07:08:52.283140"], ["id", 86]]
---
  def update
    film = Film.find params[:id]
    film.update film_params