elena_ovsyannikova/week6/filmlibrary/app/controllers/ratings_controller.rb

SELECT  "films".* FROM "films" WHERE "films"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
---
  def new
    @film = Film.find params[:film_id]

INSERT INTO "ratings" ("film_id", "user_id", "created_at", "updated_at", "review") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["film_id", 38], ["user_id", 10], ["created_at", "2019-01-24 01:55:32.098469"], ["updated_at", "2019-01-24 01:55:32.098469"], ["review", "comment"]]
---
  def create
    film_id = params[:film_id]
    rating = Rating.create rating_params